[
    {
      "id": "sock-radio",
      "title": "SOCK Radio",
      "portPic": "./pics/sock/sock-logov2-01.png",
      "alt": "screenshot of SOCK website",
      "style": "dual",
      "link": "https://sock.rocks/",
      "detail": [
        {
          "id": "intro",
          "type": "left",
          "caption": "SOCK Radio is a quarantine project started by myself and a close friend. After launching the website, we grew to have weekly shows from six different people throughout the summer of 2020. The channel has recently returned, and has been a great source of learning for me in terms of website design, React, and other web-dev areas (click the title above to check it out!).",
          "image": "../pics/sock/sockLogo01.png",
          "alt": "SOCK radio logo"
        },
        {
          "id": "old-site",
          "type": "title",
          "title": "Original Website"
        },
        {
          "id": "slideshow",
          "type": "video",
          "caption": "Above are the pages for the original SOCK Radio website, which was very simple and built with the classic HTML-CSS-JS combo. Early on we recognized many drawbacks of this system, especially in terms of the stream player and listener experience.",
          "video": "../pics/sock/sockSlideshow.mp4",
          "controls": false,
          "autoplay": true,
          "loop": true,
          "alt": "screenshot of SOCK radio home"
        },
        {
          "id": "redesign",
          "type": "title",
          "title": "Redesign"
        },
        {
          "id": "new-slideshow",
          "type": "video",
          "caption": "Here are the same pages, with the redesign (this can also be seen by visiting the website). Ultimately, I found the previous design too dark and uninviting, and wanted something a little more interesting and user friendly. We added a live chat for listeners, which has turned out to be an excellent addition, and the stream player is much more functional now - it notifies the user when the stream is live, seen below. The site will continue to be updated throughout the year as we return to more of our programming.",
          "video": "../pics/sock/newSlideshow.mp4",
          "controls": false,
          "autoplay": true,
          "loop": true,
          "alt": "video showing 3 main pages of sock radio redesign"
        },
        {
          "id": "live-functionality",
          "type": "video",
          "caption": "This video demonstrates the newer player functionality, a small but important change that means the site notifies people when the stream has gone online. The end of the video also shows the button switching back to offline when the stream has ended.",
          "video": "../pics/sock/sockExample.mp4",
          "controls": false,
          "autoplay": true,
          "loop": true,
          "alt": "video of stream button going live"
        }
      ]
    },

    {
      "id": "apps",
      "title": "Apps",
      "portPic": "../pics/apps/apps.png",
      "alt": "screenshot of government info app",
      "style": "dual",
      "detail": [
        {
          "id": "intro",
          "type": "left",
          "caption": "I built these two apps for a Mobile App Design course, and I was pleased with how they turned out. More importantly, it gave me a solid understanding of building an app in the Android architecture, as well as shoring up my knowledge of Java. Both apps used a variety of data structures and methods for running API calls to display data to the user.",
          "image": "../pics/apps/apps.png",
          "alt": "The two apps side-by-side"
        },
        {
          "id": "knowyourgovernment",
          "type": "title",
          "title": "Know Your Government"
        },
        {
          "id": "gov-overview",
          "type": "overlap",
          "caption1": "This app takes note of the user's location, then displays a list of the government officials who represent them, using Google's Civic Information API. In this image, the location is Chicago, and the list is ordered by the scope of the position with highest first. The user can also input any location of their choosing via zipcode or city name, allowing them to see the representatives for that area.",
          "caption2": "Here is an example of the detail provided when the user clicks on a representative. In this case, it is Senator Dick Durbin, and the app displays his photo along with a corresponding party image with the contact information below. Social media links are only displayed if they exist in the API.",
          "image1": "../pics/apps/gov01.PNG",
          "image2": "../pics/apps/gov02.PNG",
          "alt1": "list of government officials in app once location entered",
          "alt2": "detail view of dick durbin in app"
        },
        {
          "id": "gov-final",
          "type": "right",
          "caption": "This is the contact information that is associated with the senator selected. Also, tapping on the image will bring up a larger photo without the additional information underneath.",
          "image": "../pics/apps/gov03.PNG",
          "alt": "selected offical scrolled to show contact information"
        },
        {
          "id": "newsgateway",
          "type": "title",
          "title": "News Gateway"
        },
        {
          "id": "news-overview",
          "type": "overlap",
          "caption1": "The News Gateway app uses NewsAPI to display snippets about articles from various sources, along with the links to those articles. It can sort by genre of publisher and makes use of services and receivers.",
          "caption2": "On the right, the genre selection is shown which then shortens the drawer list to relevant sources of news. In this case, the selection has already been made for the Entertainment category.",
          "image1": "../pics/apps/news01.PNG",
          "image2": "../pics/apps/news02.PNG",
          "alt1": "news app homepage",
          "alt2": "news app with entertainment selected and genre menu open"
        },
        {
          "id": "news-final",
          "type": "right",
          "caption": "This is an image of the app once a source has been selected. It proceeds to show 10 articles with a ViewPager, allowing the user to swipe between the fragments that show each article with its title and summary. Clicking on any of the content displayed will then link the user to the original article in the phone's browser.",
          "image": "../pics/apps/news03.PNG",
          "alt": "selected offical scrolled to show contact information"
        }
      ]
    },

    {
      "id": "ipro",
      "title": "Campus Bike Lock",
      "portPic": "./pics/ipro/prototype-bike.jpg",
      "alt": "pic of foam bike with prototype lock",
      "style": "dual",
      "detail": [
        {
          "id": "intro",
          "type": "left",
          "caption": "This prototype bike lock was designed and built for an interprofessional project course, with the ultimate goal being a way to improve the bicycle facilities on campus. The lock used RFID scanning so students would be able to use their IIT ID cards to lock and unlock them, removing the need for them to carry a bike lock to campus. We also designed it to be as strong or stronger than a lock that could be carried with you in order to ensure safety was not compromised.",
          "image": "../pics/ipro/prototype-bike.jpg",
          "alt": "pic of foam bike with prototype lock"
        },
        {
          "id": "design",
          "type": "title",
          "title": "Design"
        },
        {
          "id": "3d",
          "type": "right",
          "caption": "Our initial design was a simple post with a metal bar that would enclose the bike, shown in this mockup. However, we decided against this and moved to a heavy chain, due to size variations in bicycles and the space required for a hinged metal bar opening. Also in this image the front wheel is not secured, something we addressed in later designs.",
          "image": "../pics/ipro/model.png",
          "alt": "3d mockup of early design with hinged arm"
        },
        {
          "id": "protoype-cad",
          "type": "left",
          "caption": "This is a CAD representation of the prototype that was to be laser cut from medium MDF. The additional extensions at the bottom were for adding wheel locking capability. Ideally, we wanted to be able to lock both wheels with one chain, but these bike locks would also mean people could secure their front wheel with their own cable lock, removing the need to bring a heavy U-lock.",
          "image": "../pics/ipro/prototype-model.JPG",
          "alt": "cad of prototype"
        },
        {
          "id": "me",
          "type": "right",
          "caption": "My involvement was primarily focused on the scanning functionality, security, and usability of the bike rack. I felt that I was able to bring a useful amount of knowledge to the team since I was the only one who actually commuted by bike, and thus I was able to streamline some of the design and build processes, like moving to the chain instead of a metal bar. In this photo, I'm on the left working on the Arduino code that handled the scanning system for the rack.",
          "image": "../pics/ipro/me-working.jpg",
          "alt": "me working on arduino at table"
        },
        {
          "id": "build",
          "type": "title",
          "title": "Build"
        },
        {
          "id": "interior",
          "type": "doubleImg",
          "caption": "Above are images of the prototype with the Arduino and RFID scanner installed. This setup takes the signal from the scanner and controls a servo motor in the lower section, which operates the locking mechanism. This can be seen below in some videos of the mechanism.",
          "left": "../pics/ipro/interior.JPG",
          "right": "../pics/ipro/scanner.JPG",
          "leftAlt": "interior of prototype",
          "rightAlt": "closeup of prototype interior"
        },
        {
          "id": "mechanism",
          "type": "doubleVid",
          "caption": "These videos demonstrate the mechanism functioning when the RFID card is scanned. Something like this is all that would be needed to secure the end of a chain, and could be made to be very strong. This central position was also chosen based on a scaled bike, but could be relocated for locking wheels. Ultimately, a semester was too short to see this project grow any more, which was unfortunate because I was excited that there was a possibility this could have actively benefitted the campus and student transportation.",
          "left": "../pics/ipro/mechanism-int.mp4",
          "right": "../pics/ipro/mechanism-ext.mp4",
          "controls": false,
          "autoplay": true,
          "loop": true,
          "muted": true,
          "leftAlt": "video of internal mechanism",
          "rightAlt": "video of mechanism as seen through lock hole"
        }
      ]
    },

    {
      "id": "cinepod",
      "title": "CinePod",
      "portPic": "./pics/cinepod/snow.jpg",
      "alt": "builders of pod celebrating its use outside",
      "style": "dual",
      "detail": [
        {
          "id": "intro",
          "type": "left",
          "caption": "The CinePod began as an idea from a discussion with my friends about watching movies in the winter. I'm lucky enough to have an old projector and garage that we were able to watch movies on outside the past summer, while staying distanced and masked for safety. We wanted to continue watching into the winter, and thus the idea of some sort of pod was conceived. This project is the result of actually following through on building a wooden pod.",
          "image": "../pics/cinepod/pod-done.JPG",
          "alt": "guy sitting in pod frame"
        },
        {
          "id": "design",
          "type": "title",
          "title": "Design"
        },
        {
          "id": "cad",
          "type": "doubleImg",
          "caption": "On the left is a screenshot of the 2x4 frame in CAD, used as an initial mockup. This design was chosen for simplicity and cost, as previous designs for a disassemblable pod were far outside the budget I set myself.",
          "left": "../pics/cinepod/cad-frame.PNG",
          "right": "../pics/cinepod/img01.PNG",
          "leftAlt": "cad model of pod frame",
          "rightAlt": "cad model of finished pod"
        },
        {
          "id": "build",
          "type": "title",
          "title": "Build"
        },
        {
          "id": "frame",
          "type": "overlap",
          "caption1": "Building the pod base, making use of some scrap wood that was laying around for a central beam. Here some of the internal supports are being glued in place. These supports were primarily to keep me from breaking through the thin plywood floor during a viewing.",
          "caption2": "The floor was then cut to fit the 2x4 posts before the rest of the frame was assembled. The joints of the frame were kept as simple as possible, using corner butt joints and #10 wood screws to connect them. Also pictured here is my friend who assisted me during the build (great guy).",
          "image1": "../pics/cinepod/pod-base.JPG",
          "image2": "../pics/cinepod/pod-frame.JPG",
          "alt1": "pod base being assembled",
          "alt2": "pod frame completed in real life"
        },
        {
          "id": "wall",
          "type": "right",
          "caption": "First side wall attached. These were cut from 1/4'' OSB, and were important not only for warmth but also adding structural integrity. They definitely do not provide good insulation, but that's where the space heater comes in.",
          "image": "../pics/cinepod/pod-wall.JPG",
          "alt": "pod frame completed in real life"
        },
        {
          "id": "finished",
          "type": "title",
          "title": "End Result"
        },
        {
          "id": "details",
          "type": "doubleImg",
          "caption": "Above are some close-ups of the door and window. The door is held shut via magnet cabinet latches, and the window is simply bolted to the wall. All the windows were then sealed with silicone for better wind protection, which made a noticeable difference. At the moment, the pod is able to reach an internal temperature of about 60 degrees fahrenheit while the exterior temperature is 30, which makes for a very comfortable viewing experience. Of course it doesn't help that it takes two people to move... but I think it was well worth it. If you're thinking of building one for yourself, it did cost about $250, which is definitely more than I wanted to spend.",
          "left": "../pics/cinepod/door-detail.JPG",
          "right": "../pics/cinepod/window-detail.JPG",
          "leftAlt": "close-up of pod door",
          "rightAlt": "close-up of left side window"
        }
      ]
    },

    {
      "id": "calculator",
      "title": "MIPS Calculator",
      "portPic": "../pics/mips/mips-button.png",
      "alt": "screenshot of MIPS calculator running",
      "style": "dual",
      "detail": [
        {
          "id": "intro",
          "type": "left",
          "caption": "This project was a calculator built in the assembly language MIPS using QtSPIM. It allowed for addition, subtraction, multiplication, division, and conversions between decimal, hex, and binary numbers. I personally enjoyed this project and had some fun doing the ASCII-art design for the interface, which I felt improved the user experience beyond a console line.",
          "image": "../pics/mips/home.PNG",
          "alt": "pic of conversions menu for calculator"
        },
        {
          "id": "simple",
          "type": "title",
          "title": "Simple Functions"
        },
        {
          "id": "add-sub",
          "type": "doubleImg",
          "caption": "Above are examples for addition and subtraction, with a bit of flair in the menu design.",
          "left": "../pics/mips/addition.PNG",
          "right": "../pics/mips/subtraction.PNG",
          "leftAlt": "pic of addition example in calculator",
          "rightAlt": "pic of subtraction example in calculator"
        },
        {
          "id": "mult-div",
          "type": "doubleImg",
          "caption": "Here are multiplication and division. The division function is limited to whole numbers.",
          "left": "../pics/mips/multi.PNG",
          "right": "../pics/mips/division.PNG",
          "leftAlt": "pic of multiplication example in calculator",
          "rightAlt": "pic of division example in calculator"
        },
        {
          "id": "conversions",
          "type": "title",
          "title": "Conversions"
        },
        {
          "id": "conv-example",
          "type": "doubleImg",
          "caption": "This is the conversion menu, and an example of a binary-to-decimal conversion. This component of the calculator made up the meat of the project, and I was satisfied with my solution because the conversions handle negative numbers as well, which was not a requirement. I also attempted to make the menu as clear as possible, as the choice to use a more graphical style in the console was purely functional.",
          "left": "../pics/mips/conversions.PNG",
          "right": "../pics/mips/bindec.PNG",
          "leftAlt": "pic of conversion menu in calculator",
          "rightAlt": "pic of binary-decimal conversion example in calculator"
        }
      ]
    },

    {
      "id": "digital",
      "title": "Digital Imaging",
      "portPic": "./pics/digital/digital01.png",
      "alt": "screencap of 3d music video",
      "style": "dual",
      "detail": [
        {
          "id": "intro",
          "type": "video",
          "caption": "For my digital imaging class, my end-of-semester project was a music video for a song I had created. I had never worked in any 3D modelling software, so I wanted to learn the basics and create fitting visuals for my house-styled track.",
          "video": "../pics/digital/digital-video.mp4",
          "controls": true,
          "autoplay": false,
          "alt": "music video for 2014 20 hour"
        }
      ]
    }
]
