[
    {
      "id": "cinepod",
      "title": "CinePod",
      "portPic": "./pics/cinepod/snow.JPG",
      "alt": "person sitting in unfinished covid pod",
      "style": "dual",
      "detail": [
        {
          "id": "intro",
          "type": "left",
          "caption": "The CinePod began as an idea from a discussion with my friends about watching movies in the winter. I am lucky enough to have an old projector and garage that we were able to watch movies on outside the past summer, while staying distanced and masked for safety. We wanted to continue watching into the winter, and thus the idea of some sort of pod was conceived. This project is the result of actually following through on building a wooden pod.",
          "image": "../pics/cinepod/pod-done.jpg",
          "alt": "guy sitting in pod frame"
        },
        {
          "id": "design",
          "type": "title",
          "title": "Design"
        },
        {
          "id": "cad",
          "type": "doubleImg",
          "caption": "On the left is a screenshot of the 2x4 frame in CAD, used as an initial mockup. This design was chosen for simplicity and cost, as previous designs for a disassemblable pod were far outside the budget I set myself.",
          "left": "../pics/cinepod/cad-frame.png",
          "right": "../pics/cinepod/img01.png",
          "leftAlt": "cad model of pod frame",
          "rightAlt": "cad model of finished pod"
        },
        {
          "id": "build",
          "type": "title",
          "title": "Build"
        },
        {
          "id": "frame",
          "type": "overlap",
          "caption1": "Building the pod base, making use of some scrap wood that was laying around for a central beam. Here some of the internal supports are being glued in place. These supports were primarily to keep me from breaking through the thin plywood floor during a viewing.",
          "caption2": "The floor was then cut to fit the 2x4 posts before the rest of the frame was assembled. The joints of the frame were kept as simple as possible, using corner butt joints and #10 wood screws to connect them. Also pictured here is my friend who assisted me during the build (great guy).",
          "image1": "../pics/cinepod/pod-base.jpg",
          "image2": "../pics/cinepod/pod-frame.jpg",
          "alt1": "pod base being assembled",
          "alt2": "pod frame completed in real life"
        },
        {
          "id": "wall",
          "type": "right",
          "caption": "First side wall attached. These were cut from 1/4'' OSB, and were important not only for warmth but also adding structural integrity. They definitely do not provide good insulation, but that's where the space heater comes in.",
          "image": "../pics/cinepod/pod-wall.jpg",
          "alt": "pod frame completed in real life"
        },
        {
          "id": "details",
          "type": "doubleImg",
          "caption": "Above are some close-ups of the door and window. The door is held shut via magnet cabinet latches, and the window is simply bolted to the wall. All the windows were then sealed with silicone for better wind protection, which made a noticeable difference.",
          "left": "../pics/cinepod/door-detail.jpg",
          "right": "../pics/cinepod/window-detail.jpg",
          "leftAlt": "close-up of pod door",
          "rightAlt": "close-up of left side window"
        }
      ]
    },

    {
      "id": "sock-radio",
      "title": "SOCK Radio",
      "portPic": "./pics/sock/sockLogo01.png",
      "alt": "screenshot of SOCK website",
      "style": "dual",
      "link": "https://sock.rocks/",
      "detail": [
        {
          "id": "intro",
          "type": "left",
          "caption": "SOCK Radio is a quarantine project started by myself and a close friend. After launching the website, we grew to have weekly shows from six different people throughout the summer of 2020. The channel has recently returned, and has been a great source of learning for me in terms of website design, React, and other web-dev areas, considering that I am in charge of the website and its functionality.",
          "image": "../pics/sock/sockLogo01.png",
          "alt": "SOCK radio logo"
        },
        {
          "id": "old-site",
          "type": "title",
          "title": "Original Website"
        },
        {
          "id": "slideshow",
          "type": "video",
          "caption": "Above are the pages for the original SOCK Radio website, which was very simple and built with the classic HTML-CSS-JS combo. Very shortly we recognized many drawbacks of this system, especially in terms of the stream player and listener experience.",
          "video": "../pics/sock/sockSlideshow.mp4",
          "controls": false,
          "autoplay": true,
          "loop": true,
          "alt": "screenshot of SOCK radio home"
        },
        {
          "id": "redesign",
          "type": "title",
          "title": "Redesign"
        },
        {
          "id": "new-slideshow",
          "type": "video",
          "caption": "Here are the same pages, with the redesign (this can also be seen by visiting the website). Ultimately, I found the previous design too dark and uninviting, and wanted something a little more interesting and user friendly. We added a live chat for listeners, which has turned out to be an excellent addition, and the stream player is much more functional now - it notifies the user when the stream is live, seen below. The site will continue to be updated throughout the year as we return to more of our programming.",
          "video": "../pics/sock/newSlideshow.mp4",
          "controls": false,
          "autoplay": true,
          "loop": true,
          "alt": "video showing 3 main pages of sock radio redesign"
        },
        {
          "id": "live-functionality",
          "type": "video",
          "caption": "This video demonstrates the newer player functionality, a small but important change that means the site notifies people when the stream has gone online. When the play button is pressed, the player calls load() to ensure the listener joins live rather than on a delay. The end of the video also shows the button switching back to offline when the stream has ended.",
          "video": "../pics/sock/sockExample.mp4",
          "controls": false,
          "autoplay": true,
          "loop": true,
          "alt": "video of stream button going live"
        }
      ]
    },

    {
      "id": "apps",
      "title": "Apps",
      "portPic": "./pics/apps/apps.png",
      "alt": "screenshot of government info app",
      "style": "dual",
      "detail": [
        {
          "id": "intro",
          "type": "left",
          "caption": "I built these two apps for a Mobile App Design course, and I was pleased with how they turned out. More importantly, it gave me a solid understanding of building an app in the Android architecture, as well as shoring up my knowledge of Java. Both shown used a variety of data structures and methods for running API calls to display data to the user.",
          "image": "../pics/apps/apps.png",
          "alt": "The two apps side-by-side"
        },
        {
          "id": "knowyourgovernment",
          "type": "title",
          "title": "Know Your Government"
        },
        {
          "id": "gov-overview",
          "type": "overlap",
          "caption1": "This app takes note of the user's location, then displays a list of the government officials who represent them, using Google's Civic Information API. In this image, the location is Chicago, and the list is ordered by the scope of the position with highest first (hence president at the top). The user can also input any location of their choosing via zipcode or city name, and you can see the representatives for that area.",
          "caption2": "Here is an example of the detail provided when the user clicks on a representative. In this case, it is senator Dick Durbin, and the app displays his photo along with a corresponding party image, and beneath the photo is his contact information. Social media links are only displayed if they exist in the API.",
          "image1": "../pics/apps/gov01.png",
          "image2": "../pics/apps/gov02.png",
          "alt1": "list of government officials in app once location entered",
          "alt2": "detail view of dick durbin in app"
        },
        {
          "id": "newsgateway",
          "type": "title",
          "title": "News Gateway"
        },
        {
          "id": "news-overview",
          "type": "overlap",
          "caption1": "This app takes note of the user's location, then displays a list of the government officials who represent them, using Google's Civin Information API. In this image, the location is Chicago, and the list is ordered by the scope of the position with highest first (hence president at the top).",
          "caption2": "Here is an example of the detail provided when the user clicks on a representative. In this case, it is senator Dick Durbin, and the app displays his photo along with a corresponding party image, and beneath the photo is his contact information. Social media links are only displayed if they exist in the API.",
          "image1": "../pics/apps/news01.png",
          "image2": "../pics/apps/news02.png",
          "alt1": "list of government officials in app once location entered",
          "alt2": "detail view of dick durbin in app"
        }
      ]
    },

    {
      "id": "ipro",
      "title": "Campus Bike Lock",
      "portPic": "./pics/ipro/ipro01.jpg",
      "alt": "interior of bike lock prototype"
    },

    {
      "id": "calculator",
      "title": "MIPS Calculator",
      "portPic": "",
      "alt": "screenshot of MIPS calculator running"
    },

    {
      "id": "digital",
      "title": "Digital Imaging",
      "portPic": "./pics/digital/digital01.png",
      "alt": "screencap of 3d music video",
      "style": "dual",
      "detail": [
        {
          "id": "intro",
          "type": "video",
          "caption": "For my digital imaging class, my end-of-semester project was a music video for a song I had created. I had never worked in any 3D modelling software, so I wanted to attempt to learn the basics and create fitting visuals for my house-styled track.",
          "video": "../pics/digital/digital-video.mp4",
          "controls": true,
          "autoplay": false,
          "alt": "music video for 2014 20 hour"
        }
      ]
    }
]
